Oblig1/les/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue; //turbulentInlet;
        //referenceField  uniform (10 0 0);
        //fluctuationScale (0.02 0.01 0.01);
        value           uniform (10 0 0);
    }

    outlet
    {
        type            zeroGradient; //inletOutlet;
        //inletValue      uniform (0 0 0);
        //value           uniform (0 0 0);
    }

    //upperWall
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    //lowerWall
    //{
    //    type            fixedValue;
    //    value           uniform (0 0 0);
    //}

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
